{"sightings":[{"text":"Witnessed an orange, slow moving light. Was looking out my window and saw a orange colored, non blinking light floating across the night sky. Woke up my daughters to confirm what I was seeing. The object did not blink, was definitely not a helicopter. Very bright orange and moved slowly for about 2 minutes, disappeared behind the trees and did not see it again. Never seen anything like this in my life.","date_time":"10/2/19 22:00","city":"Black Mountain","state":"NC","shape":"Fireball","duration":"2 minutes","summary":"Witnessed an orange, slow moving light. Was looking out my window and saw a orange colored, non blinking light floating across the night"},{"text":"Glowing lights in formation  just south of San Quentin I witnessed 10 or 11 spherical glowing objects in formation swarming and hovering near the top of Ring Mtn. -Corte Madera.  I very quickly ran up to 2 firemen emergency responders to ask them to quote \"take a quick glance at what is going on over here\".  They flat out refused to take 5 steps over to the side to look at what I was trying to show them.  They were handling some kind of a medical emergency, but it would have been really nice to have them witness this because this was highlight of the whole night.","date_time":"10/2/19 22:00","city":"Marin County","state":"CA","shape":"Sphere","duration":"3 minutes","summary":"Glowing lights in formation  just south of San Quentin"},{"text":"Saw a great big glowy cloud in the sky. Definitely a UFO! Might've seen an alien wave at me from inside.","date_time":"12/09/2020 20:23","city":"Huntsville","state":"Alabama","shape":"Fireball","duration":"2 minutes","summary":"Glowy cloud shape UFO spotted in the sky."},{"text":"Saw a ball of clouds in the sky, looked like the shape of a UFO!","date_time":"11/02/92 20:11","city":"Kuala Lumpur","state":"Selangor","shape":"Sphere","duration":"1 minute","summary":"Ball of clouds UFO spotted"},{"text":"Saw a big star that looked like a UFO","date_time":"19/03/92 21:21","city":"Huntsville","state":"Alabama","shape":"Star","duration":"3 minutes","summary":"Big star UFO spotted"},{"text":"There a big swirly shape in the sky filled with stars. Looked like a UFO for sure.","date_time":"3/10/99 22:03","city":"Phoenix","state":"Arizona","shape":"Swirl","duration":"2 minutes","summary":"Swirly UFO spotted in the sky"}]}